const About = () => {
  return (<>
    <h1>О нас</h1>
    <section>
    <h2>Наша команда</h2>
    <div>
<p>В "Мастерская Ванных" мы гордимся нашей командой профессионалов, которые делают возможным создание идеальных ванных комнат. Каждый из нас — это высококвалифицированный специалист, обладающий богатым опытом и страстью к своему делу. Мы работаем вместе, чтобы обеспечить нашим клиентам наилучший результат и превратить их мечты в реальность.</p>

<h2>Наши специалисты:</h2>

<h3>Дизайнеры интерьеров:</h3>
<p>Наши дизайнеры обладают креативным мышлением и глубокими знаниями в области современных тенденций. Они помогут вам создать уникальный и функциональный дизайн вашей ванной комнаты, учитывая ваши предпочтения и стиль жизни.</p>

<h3>Сантехники:</h3>
Команда опытных сантехников обеспечивает качественную установку и обслуживание сантехнического оборудования. Мы гарантируем, что все работы будут выполнены в соответствии с высокими стандартами безопасности и качества.

<h3>Отделочники:</h3>
Наши мастера по отделке имеют богатый опыт в укладке плитки, покраске и других отделочных работах. Они уделяют внимание каждой детали, чтобы ваша ванная комната выглядела безупречно.

<h3>Проектировщики:</h3>
Проектировщики нашей команды занимаются разработкой технической документации и планов, что позволяет нам эффективно организовать процесс ремонта и избежать возможных проблем.

<h3>Менеджеры проектов:</h3>
Наши менеджеры проектов координируют все этапы работы, обеспечивая соблюдение сроков и бюджета. Они всегда на связи и готовы ответить на ваши вопросы, чтобы вы чувствовали себя уверенно на каждом этапе ремонта.

<h2>Наша философия</h2>
Мы верим, что успешный проект — это результат командной работы и взаимопонимания. Каждый член нашей команды вносит свой вклад в общий успех, и мы стремимся к тому, чтобы каждый клиент остался доволен результатом. Наша цель — не просто выполнить ремонт, а создать пространство, в котором вы будете чувствовать себя комфортно и счастливо.

Мы постоянно обучаемся и развиваемся, чтобы быть в курсе последних тенденций и технологий в области ремонта. С нами вы можете быть уверены, что ваша ванная комната будет не только красивой, но и функциональной, отвечающей всем вашим потребностям.</div>
  </section>
  
  <section>
  <h2>Фотографии выполненных работ</h2>
    <div className="flex flex-row flex-wrap -mx-2 justify-center">
      <img className="p-2 md:w-1/2" src="/images-1.jpg" alt="/images-1.jpg" />
      <img className="p-2 md:w-1/2" src="/images-2.jpg" alt="/images-2.jpg" />
      <img className="p-2 md:w-1/2" src="/images-3.jpg" alt="/images-3.jpg" />
    </div>
  </section>
  
  <section>
  <h2>Отзывы клиентов</h2>
  <div>
    <h3 className="">Ирина П.</h3>
    <div>"Я очень довольна работой команды 'Мастерская Ванных'! Они полностью преобразили мою ванную комнату, и теперь это мое любимое место в доме. Дизайнер предложил отличные идеи, а мастера выполнили все работы быстро и качественно. Особенно понравилось, что они всегда были на связи и отвечали на все мои вопросы. Рекомендую всем!"</div>
  </div>

  <div>
    <h3 className="">Сергей А.</h3>
    <div>"Обратился в 'Мастерская Ванных' по рекомендации друга, и не пожалел! Ремонт прошел без задержек, а качество работы превзошло все ожидания. Сантехники сделали свою работу на высшем уровне, и теперь у меня нет никаких проблем с водопроводом. Спасибо за профессионализм и внимательное отношение к клиентам!"</div>
  </div>

  <div>
    <h3 className="">Карина О.</h3>
    <div>"Я долго искала компанию, которая могла бы сделать ремонт в ванной комнате, и наконец нашла 'Ремонт Ванных'. С самого начала меня поразило, как внимательно они отнеслись к моим пожеланиям. Результат превзошел все ожидания! Ванная комната стала не только красивой, но и очень удобной. Огромное спасибо всей команде за отличную работу!"</div>
  </div>  
  </section>  
  </>)

}

export default About;