import { useEffect, useState } from "react";
import api_fetch from '@/api_fetch.js'
import { NavLink } from 'react-router'
import Button from '@/component/Button.jsx'


const Blog = () => {
  const [status, setStatus] = useState({})
  const [posts, setPosts] = useState([])

  useEffect( () => {
    const fetchPosts = async () => {
      setStatus({ loading: true })      
      const resp = await api_fetch("/posts")
      if( resp.ok ) {
        setPosts( resp.posts )
      } else {
        setStatus({ error: resp.error })
      }
      setStatus({ ok: true })
    }
    fetchPosts();
  }, [])

  return (
  <>
  <h1>Блог</h1>

  { status?.loading && <div>Загрузка данных с сервера</div> }
  
  { status?.error && <div>(!) { status.error } </div> }
  
  <section>      
  <h2>Статьи</h2>
  { posts.length > 0 && posts.map( v => { 
    return (<>
    <article key={ v._id } className="mb-4">
      <h2 className="font-semibold">{ v?.title ?? ""}</h2>
      <div>{ v?.body ?? "" }</div>
      <Button className="mt-2"><NavLink to={ "/posts/".concat(v._id) }>Подробнее</NavLink></Button>
    </article>
    <br />
    </>) } ) 
  }
  </section>  
  <section>
  <h2>Советы</h2>
  <div>
    <h3>1. Планируйте пространство заранее</h3>
    <p>Перед началом ремонта важно тщательно спланировать, как будет выглядеть ваша ванная комната. Определите, какие элементы вам необходимы (унитаз, раковина, душ или ванна) и как они будут расположены. Используйте 3D-визуализации или простые эскизы, чтобы увидеть, как будет выглядеть конечный результат. Убедитесь, что между элементами достаточно пространства для комфортного использования. Это поможет избежать неудобств в будущем и сделает вашу ванную комнату более функциональной.</p>
    <h3>2. Выбирайте качественные материалы</h3>
    <p>При ремонте ванной комнаты важно использовать влагостойкие и долговечные материалы. Плитка, сантехника и отделочные материалы должны быть устойчивыми к влаге и перепадам температуры. Обратите внимание на качество и репутацию производителей. Хотя качественные материалы могут стоить дороже, они обеспечат долговечность и снизят вероятность необходимости ремонта в будущем.</p>
    <h3>3. Не забывайте о вентиляции</h3>
    <p>Правильная вентиляция — ключевой аспект в ванной комнате, который часто игнорируется. Убедитесь, что в вашей ванной комнате есть качественная вентиляционная система, чтобы предотвратить образование плесени и грибка. Если возможно, установите вытяжной вентилятор, который будет работать автоматически при включении света. Это поможет поддерживать свежесть и чистоту в помещении, а также продлит срок службы отделочных материалов.</p>
  </div>
  </section>

  </>)
}

export default Blog;