const Main = () => {
  return (<>
  <h1>Главная</h1>
  
  <div>
    <p>Наша компания, "Мастерская Ванных", специализируется на создании стильных и функциональных ванных комнат, которые становятся настоящими оазисами комфорта в вашем доме. С более чем 10-летним опытом в сфере ремонта, мы гордимся высоким качеством наших услуг и индивидуальным подходом к каждому клиенту.</p>
    <p>Мы предлагаем полный спектр услуг: от разработки дизайна и выбора материалов до профессиональной установки и отделки. Наша команда состоит из квалифицированных специалистов, которые используют только современные технологии и проверенные материалы, чтобы гарантировать долговечность и эстетическую привлекательность каждого проекта.</p>
    <p>Мы понимаем, что ремонт — это важный шаг, и стремимся сделать его максимально комфортным и беззаботным для вас. С нами вы можете быть уверены, что ваша ванная комната станет не только красивой, но и удобной для повседневного использования.</p>
    <p>Доверьте нам создание вашего идеального пространства, и мы превратим ваши мечты в реальность!</p>
  </div>
  
  <div>
  <h3>1. Профессионализм и опыт:</h3>
  Наша команда состоит из высококвалифицированных специалистов с более чем 10-летним опытом в сфере ремонта ванных комнат.

  <h3>2. Индивидуальный подход:</h3>
  Мы учитываем все пожелания и требования клиентов, предлагая уникальные решения, которые соответствуют вашему стилю и бюджету.

  <h3>3. Качество материалов:</h3>
  Мы работаем только с проверенными и надежными поставщиками, что гарантирует долговечность и высокое качество используемых материалов.

  <h3>4. Комплексные услуги:</h3>
Предлагаем полный спектр услуг: от проектирования и выбора материалов до выполнения всех этапов ремонта, включая сантехнические и отделочные работы.

  <h3>5. Современные технологии:</h3>
  Используем новейшие технологии и методы, что позволяет нам достигать высоких стандартов качества и эффективности.

  <h3>6. Прозрачность цен:</h3>
  Мы предоставляем четкие сметы и не скрываем дополнительные расходы, чтобы вы всегда знали, за что платите.

  <h3>7. Гарантия на работу:</h3>
  Мы уверены в качестве своих услуг и предоставляем гарантию на выполненные работы, что обеспечивает дополнительное спокойствие нашим клиентам.

  <h3>8. Соблюдение сроков:</h3>
  Мы ценим ваше время и гарантируем выполнение работ в оговоренные сроки без задержек.

  <h3>9. Отличное послепродажное обслуживание:</h3>
  Мы всегда готовы ответить на ваши вопросы и помочь с любыми проблемами даже после завершения проекта.

  </div>
  </>)
}

export default Main;